export default {
  projections: {
    ДокПланЗаНаДE: {
      номер: {
        __caption__: 'Номер'
      },
      дата: {
        __caption__: 'Дата'
      },
      время: {
        __caption__: 'Время'
      },
      спрКонтрАг: {
        __caption__: 'Организация',
        наименование: {
          __caption__: 'Организация'
        }
      },
      спрОбъектСтр: {
        __caption__: 'Объект строительства',
        наименование: {
          __caption__: 'Объект строительства'
        }
      },
      спрПользов: {
        __caption__: 'Автор',
        фИО: {
          __caption__: 'Автор'
        },
        должность: {
          __caption__: 'Должность'
        }
      },
      тЧПлЗаНаД: {
        __caption__: 'План задач на день',
        стЗатрат: {
          __caption__: 'Статья затрат'
        },
        спрНомен: {
          __caption__: 'Номенклатура',
          наименование: {
            __caption__: 'Номенклатура'
          }
        },
        спрКонтрАг: {
          __caption__: 'Контрагент',
          наименование: {
            __caption__: 'Контрагент'
          }
        },
        спрВидыРаб: {
          __caption__: 'Виды работы',
          наименование: {
            __caption__: 'Виды работы'
          }
        },
        объемРаботы: {
          __caption__: 'Объем работы'
        },
        спрТранспСр: {
          __caption__: 'Транспортное средство',
          наименование: {
            __caption__: 'Транспортное средство'
          }
        },
        спрТипТрансСр: {
          __caption__: 'Тип транспортного средства',
          наименование: {
            __caption__: 'Тип транспортного средства'
          }
        },
        врПрибытия: {
          __caption__: 'Время прибытия'
        },
        колЧасРаб: {
          __caption__: 'Количество часов работы'
        },
        обГруз: {
          __caption__: 'Объем груза'
        },
        спрЕдИзмер: {
          __caption__: 'Единица измерения',
          наименование: {
            __caption__: 'Единица измерения'
          }
        }
      }
    },
    ДокПланЗаНаДL: {
      номер: {
        __caption__: 'Номер'
      },
      дата: {
        __caption__: 'Дата'
      },
      время: {
        __caption__: 'Время'
      },
      спрКонтрАг: {
        __caption__: 'Организация',
        наименование: {
          __caption__: 'Организация'
        }
      },
      спрОбъектСтр: {
        __caption__: 'Объект строительства',
        наименование: {
          __caption__: 'Объект строительства'
        }
      },
      спрПользов: {
        __caption__: 'Автор',
        фИО: {
          __caption__: 'Автор'
        },
        должность: {
          __caption__: 'Должность'
        }
      }
    }
  },
  validations: {
    время: {
      __caption__: 'Время'
    },
    дата: {
      __caption__: 'Дата'
    },
    номер: {
      __caption__: 'Номер'
    },
    спрКонтрАг: {
      __caption__: 'Организация'
    },
    спрОбъектСтр: {
      __caption__: 'Объект строительства'
    },
    спрПользов: {
      __caption__: 'Автор'
    },
    тЧПлЗаНаД: {
      __caption__: 'План задач на день'
    }
  }
};
