export default {
  projections: {
    ТчПлЗаНаДE: {
      спрНомен: {
        __caption__: 'Номенклатура',
        наименование: {
          __caption__: 'Номенклатура'
        }
      },
      стЗатрат: {
        __caption__: 'Статья затрат'
      },
      спрКонтрАг: {
        __caption__: 'Контрагент',
        наименование: {
          __caption__: 'Контрагент'
        }
      },
      спрВидыРаб: {
        __caption__: 'Виды работы',
        наименование: {
          __caption__: 'Виды работы'
        }
      },
      объемРаботы: {
        __caption__: 'Объем работы'
      },
      спрТранспСр: {
        __caption__: 'Транспортное средство',
        наименование: {
          __caption__: 'Транспортное средство'
        }
      },
      спрТипТрансСр: {
        __caption__: 'Тип транспортного средства',
        наименование: {
          __caption__: 'Тип транспортного средства'
        }
      },
      врПрибытия: {
        __caption__: 'Время прибытия'
      },
      колЧасРаб: {
        __caption__: 'Количество часов работы'
      },
      обГруз: {
        __caption__: 'Объем груза'
      },
      спрЕдИзмер: {
        __caption__: 'Единица измерения',
        наименование: {
          __caption__: 'Единица измерения'
        }
      }
    }
  },
  validations: {
    врПрибытия: {
      __caption__: 'Время прибытия'
    },
    датПрибыт: {
      __caption__: 'датПрибыт'
    },
    колЧасРаб: {
      __caption__: 'Количество часов работы'
    },
    обГруз: {
      __caption__: 'Объем груза'
    },
    объемРаботы: {
      __caption__: 'Объем работы'
    },
    стЗатрат: {
      __caption__: 'Статья затрат'
    },
    спрВидыРаб: {
      __caption__: 'Виды работы'
    },
    спрЕдИзмер: {
      __caption__: 'Единица измерения'
    },
    спрКонтрАг: {
      __caption__: 'Контрагент'
    },
    спрНомен: {
      __caption__: 'Номенклатура'
    },
    спрТипТрансСр: {
      __caption__: 'Тип транспортного средства'
    },
    спрТранспСр: {
      __caption__: 'Транспортное средство'
    },
    докПланЗаНаД: {
      __caption__: 'докПланЗаНаД'
    }
  }
};
